// --створити масив з:
// - з 5 числових значень
// - з 5 стічкових значень
// - з 5 значень стрічкового, числового та булевого типу
// - та вивести його в консоль

// - з 5 числових значень
// let arr=[4, 16, 2, 5, 290];
// console.log(arr);

// - з 5 стічкових значень
// let arr1=['Vasia', 'Mark', 'Oleg', 'Tomas', 'Goggle'];
// console.log(arr1);

// - з 5 значень стрічкового, числового та булевого типу
// let arr2=['Anton', 16, true, 'Rosa',25, true, 'Fenix', 22, false, 'Artemon', 2, false, 'Volga', 58, false]
// console.log(arr2);

//_____________________________________________________________________________________________

// -- Створити пустий масив. Наповнити його будь-якими значеннями звертаючись до конкретного індексу. Вивести в консоль
// let arr3=[];
// arr3[0]=11;
// arr3[1]='Xiaomi';
// arr3[2]='phone';
// arr3[3]=64;
// arr3[4]='px';
// arr3[5]='Maria';
// arr3[6]=25;
// arr3[7]='Samsung';
// arr3[8]='S4';
// arr3[9]=9000;
// console.log(arr3);


//_____________________________________________________________________________________________

// - За допомогою циклу for і document.write() вивести 10 блоків div c довільним текстом всередині
// - За допомогою циклу for і document.write() вивести 10 блоків div c довільним текстом і індексом всередині
// - За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом всередині.
// - За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом і індексом всередині.


// - За допомогою циклу for і document.write() вивести 10 блоків div c довільним текстом всередині
// for (let i=0; i<11; i++)
// {
//     let r=Math.random();
//     document.write(`<div> ${r} </div>`);
// }
// document.write(`<br>`);

// - За допомогою циклу for і document.write() вивести 10 блоків div c довільним текстом і індексом всередині
// for (let i=0; i<arr3.length; i++)
// {
//     let r=Math.random();
//     document.write(`<div> ${r}  <p> ${i} </p> </div>`);
// }

// - За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом всередині.
// let i=0;
// while (i<20)
// {
//     let r=Math.random();
//     document.write(`<h1> ${r} </h1>`);
//     i++;
// }

// - За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом і індексом всередині.
// let i=0;
// while (i<20)
// {
//     let r=Math.random();
//     document.write(`<h1> ${r} <p> ${i} </p> </h1>`);
//     i++;
// }

//_____________________________________________________________________________________________

// - Створити масив з 10 числових елементів. Вивести в консоль всі його елементи в циклі.
// - Створити масив з 10 строкрових елементів. Вивести в консоль всі його елементи в циклі.
// - Створити масив з 10 елементів будь-якого типу. Вивести в консоль всі його елементи в циклі.
// - Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести тільки булеві елементи
// - Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести тільки числові елементи
// - Створити масив з 10 елементів числового, стрічкового і булевого типу. За допомогою if та typeof вивести тільки рядкові елементи


// - Створити масив з 10 числових елементів. Вивести в консоль всі його елементи в циклі.
// let arr=[5, 21, 14, 2, 6, 79, 264, 41,50, 31];
// for (let i=0; i<arr.length; i++)
// {
//     console.log(arr[i]);
// }

// - Створити масив з 10 строкрових елементів. Вивести в консоль всі його елементи в циклі.
// let arr=['Jeje', 'Daniela', 'Cergio', 'Bella', 'Franko', 'Anna', 'Nikolai', 'Lora', 'Maria','Anastasia'];
// for (let i=0; i<arr.length; i++)
// {
//     console.log(arr[i]);
// }

// - Створити масив з 10 елементів будь-якого типу. Вивести в консоль всі його елементи в циклі.
// let arr=['Maria', 25, 'song', 'blond', 9, 32, 'tea', 44, 'coffi', 'cat'];
// for (let i=0; i<arr.length; i++)
// {
//     console.log(arr[i]);
// }

// - Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести тільки булеві елементи
// let arr=['Maria', 25, false, true, 54, 'Anna', true, 44, 122, false];
// for (let i=0; i<arr.length; i++)
// {
//     if(typeof arr[i] == 'boolean')
//     {
//         console.log(arr[i]);
//     }
// }

// - Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести тільки числові елементи
// let arr=['Maria', 25, false, true, 54, 'Anna', true, 44, 122, false];
// for (let i=0; i<arr.length; i++)
// {
//     if(typeof arr[i] == 'number')
//     {
//         console.log(arr[i]);
//     }
// }

// - Створити масив з 10 елементів числового, стрічкового і булевого типу. За допомогою if та typeof вивести тільки рядкові елементи
// let arr=['Maria', 25, false, true, 54, 'Anna', true, 44, 122, false];
// for (let i=0; i<arr.length; i++)
// {
//     if(typeof arr[i] == 'string')
//     {
//         console.log(arr[i]);
//     }
// }

// ____________________________________________________________________________________________

// - Створити порожній масив. Наповнити його 10 елементами (різними за типами) через звернення до конкретних індексів. Вивести в консоль всі його елементи в циклі.
// - Створити цикл for на 10  ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write
// - Створити цикл for на 100 ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write
// - Створити цикл for на 100 ітерацій з кроком 2. Вивести поточний номер кроку через console.log та document.write
// - Створити цикл for на 100 ітерацій. Вивести тільки парні кроки. через console.log + document.write
// - Створити цикл for на 100 ітерацій. Вивести тільки непарні кроки. через console.log + document.write


// - Створити порожній масив. Наповнити його 10 елементами (різними за типами) через звернення до конкретних індексів. Вивести в консоль всі його елементи в циклі.
// let arr=[];
// arr[0]='Maria';
// arr[1]=25;
// arr[2]=true;
// arr[3]=20;
// arr[4]='Anton';
// arr[5]=false;
// arr[6]=true;
// arr[7]=44;
// arr[8]='Lola';
// arr[9]=true;
// for (let i=0; i<arr.length; i++)
// {
//     console.log(arr[i]);
// }

// - Створити цикл for на 10  ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write
// for (let i=0; i<10; i++)
// {
//     console.log(i);
//     document.write(` ${i} `);
// }

// - Створити цикл for на 100 ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write
// for (let i=0; i<100; i++)
// {
//     console.log(i);
//     document.write(` ${i} `);
// }

// - Створити цикл for на 100 ітерацій з кроком 2. Вивести поточний номер кроку через console.log та document.write
// for (let i=0; i<100; i+=2)
// {
//     console.log(i);
//     document.write(` ${i} `);
// }

// - Створити цикл for на 100 ітерацій. Вивести тільки парні кроки. через console.log + document.write
// for (let i=0; i<100; i++)
// {
//     if (i%2==0)
//     {
//         console.log(i);
//         document.write(` ${i} `);
//     }
// }

// - Створити цикл for на 100 ітерацій. Вивести тільки непарні кроки. через console.log + document.write
// for (let i=0; i<100; i++)
// {
//     if (i%2!==0)
//     {
//         console.log(i);
//         document.write(` ${i} `);
//     }
// }

//_____________________________________________________________________________________________

// - Дано 2 масиви з рівною кількістю об'єктів. З'єднати в один об'єкт користувача та місто з відповідними "id" та "user_id" .
// Записати цей об'єкт в новий масив

let usersWithId = [
    {id: 1, name: 'vasya', age: 31, status: false},
    {id: 2, name: 'petya', age: 30, status: true},
    {id: 3, name: 'kolya', age: 29, status: true},
    {id: 4, name: 'olya', age: 28, status: false}
];

let citiesWithId = [
    {user_id: 3, country: 'USA', city: 'Portland'},
    {user_id: 1, country: 'Ukraine', city: 'Ternopil'},
    {user_id: 2, country: 'Poland', city: 'Krakow'},
    {user_id: 4, country: 'USA', city: 'Miami'}
];

for (const value of usersWithId)
{   
    for (const val of citiesWithId)
    {
        if (value.id===val.user_id)
        {
            value.adress=val;
        }
    }
    console.log(usersWithId);
}

